; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v12 ?v6)
             (pred_8 ?v8 ?v5)
             (pred_4 ?v12 ?v5)
             (pred_9 ?v3 ?v12 )
	     (pred_1 ?v12)
             (pred_11 ?v9)
             (pred_3 ?v8)
             (pred_2 ?v5)
             (pred_10 ?v12)
             (pred_7 ?v8)
             (pred_12 ?v12)
             (pred_5 ))



(:action op_2
:parameters (?v10 ?v4 ?v13 ?v2)
:precondition (and (pred_11 ?v10) (pred_11 ?v4) (pred_3 ?v13) (pred_2 ?v2)
          (pred_6 ?v10 ?v4) (pred_8 ?v13 ?v2)
                   (pred_4 ?v4 ?v2) (pred_1 ?v10) 
                   (pred_10 ?v4) (pred_7 ?v13))
:effect (and  (pred_12 ?v4) (not (pred_10 ?v4))))


(:action op_5
:parameters (?v10 ?v1)
:precondition (and (pred_11 ?v10) (pred_11 ?v1)
               (pred_1 ?v10) (pred_6 ?v10 ?v1) (pred_12 ?v1))
:effect (and (pred_1 ?v1) (not (pred_1 ?v10))))

(:action op_1
:parameters (?v10 ?v13)
:precondition (and (pred_11 ?v10) (pred_3 ?v13) 
                  (pred_1 ?v10) (pred_9 ?v13 ?v10) (pred_5 ))
:effect (and (pred_7 ?v13)
   (not (pred_9 ?v13 ?v10)) (not (pred_5 ))))


(:action op_4
:parameters (?v10 ?v11 ?v7)
:precondition (and (pred_11 ?v10) (pred_3 ?v11) (pred_3 ?v7)
                  (pred_1 ?v10) (pred_7 ?v7) (pred_9 ?v11 ?v10))
:effect (and (pred_7 ?v11) (pred_9 ?v7 ?v10)
        (not (pred_7 ?v7)) (not (pred_9 ?v11 ?v10))))

(:action op_3
:parameters (?v10 ?v13)
:precondition (and (pred_11 ?v10) (pred_3 ?v13) 
                  (pred_1 ?v10) (pred_7 ?v13))
:effect (and (pred_5 ) (pred_9 ?v13 ?v10) (not (pred_7 ?v13)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_15 obj_12 obj_04 obj_01 obj_20 obj_21 obj_26 obj_25 obj_08 obj_23 obj_31 obj_24 obj_28 obj_16 obj_05 obj_07 obj_14 obj_17 obj_19 obj_02 obj_06 obj_11 obj_30 obj_03
    obj_27 obj_22 obj_13
    obj_29 obj_09 obj_10
    )

    (:init
       (pred_5)

       (pred_11 obj_18)
       (pred_11 obj_15)
       (pred_11 obj_12)
       (pred_11 obj_04)
       (pred_11 obj_01)
       (pred_11 obj_20)
       (pred_11 obj_21)
       (pred_11 obj_26)
       (pred_11 obj_25)
       (pred_11 obj_08)
       (pred_11 obj_23)
       (pred_11 obj_31)
       (pred_11 obj_24)
       (pred_11 obj_28)
       (pred_11 obj_16)
       (pred_11 obj_05)
       (pred_11 obj_07)
       (pred_11 obj_14)
       (pred_11 obj_17)
       (pred_11 obj_19)
       (pred_11 obj_02)
       (pred_11 obj_06)
       (pred_11 obj_11)
       (pred_11 obj_30)
       (pred_11 obj_03)
       (pred_2 obj_27)
       (pred_2 obj_22)
       (pred_2 obj_13)
       (pred_3 obj_29)
       (pred_3 obj_09)
       (pred_3 obj_10)

       (pred_6 obj_18 obj_20)
       (pred_6 obj_18 obj_15)
       (pred_6 obj_15 obj_21)
       (pred_6 obj_15 obj_12)
       (pred_6 obj_15 obj_18)
       (pred_6 obj_12 obj_26)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_12 obj_15)
       (pred_6 obj_04 obj_25)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_12)
       (pred_6 obj_01 obj_08)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_20 obj_23)
       (pred_6 obj_20 obj_21)
       (pred_6 obj_20 obj_18)
       (pred_6 obj_21 obj_31)
       (pred_6 obj_21 obj_26)
       (pred_6 obj_21 obj_15)
       (pred_6 obj_21 obj_20)
       (pred_6 obj_26 obj_24)
       (pred_6 obj_26 obj_25)
       (pred_6 obj_26 obj_12)
       (pred_6 obj_26 obj_21)
       (pred_6 obj_25 obj_28)
       (pred_6 obj_25 obj_08)
       (pred_6 obj_25 obj_04)
       (pred_6 obj_25 obj_26)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_08 obj_25)
       (pred_6 obj_23 obj_05)
       (pred_6 obj_23 obj_31)
       (pred_6 obj_23 obj_20)
       (pred_6 obj_31 obj_07)
       (pred_6 obj_31 obj_24)
       (pred_6 obj_31 obj_21)
       (pred_6 obj_31 obj_23)
       (pred_6 obj_24 obj_14)
       (pred_6 obj_24 obj_28)
       (pred_6 obj_24 obj_26)
       (pred_6 obj_24 obj_31)
       (pred_6 obj_28 obj_17)
       (pred_6 obj_28 obj_16)
       (pred_6 obj_28 obj_25)
       (pred_6 obj_28 obj_24)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_28)
       (pred_6 obj_05 obj_02)
       (pred_6 obj_05 obj_07)
       (pred_6 obj_05 obj_23)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_14)
       (pred_6 obj_07 obj_31)
       (pred_6 obj_07 obj_05)
       (pred_6 obj_14 obj_11)
       (pred_6 obj_14 obj_17)
       (pred_6 obj_14 obj_24)
       (pred_6 obj_14 obj_07)
       (pred_6 obj_17 obj_30)
       (pred_6 obj_17 obj_19)
       (pred_6 obj_17 obj_28)
       (pred_6 obj_17 obj_14)
       (pred_6 obj_19 obj_03)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_19 obj_17)
       (pred_6 obj_02 obj_06)
       (pred_6 obj_02 obj_05)
       (pred_6 obj_06 obj_11)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_11 obj_30)
       (pred_6 obj_11 obj_14)
       (pred_6 obj_11 obj_06)
       (pred_6 obj_30 obj_03)
       (pred_6 obj_30 obj_17)
       (pred_6 obj_30 obj_11)
       (pred_6 obj_03 obj_19)
       (pred_6 obj_03 obj_30)
       (pred_10 obj_01)
       (pred_10 obj_12)
       (pred_10 obj_28)
       (pred_4  obj_01 obj_27)
       (pred_4  obj_12 obj_22)
       (pred_4  obj_28 obj_13)
       (pred_12 obj_18)
       (pred_12 obj_15)
       (pred_12 obj_04)
       (pred_12 obj_20)
       (pred_12 obj_21)
       (pred_12 obj_26)
       (pred_12 obj_25)
       (pred_12 obj_08)
       (pred_12 obj_23)
       (pred_12 obj_31)
       (pred_12 obj_24)
       (pred_12 obj_16)
       (pred_12 obj_05)
       (pred_12 obj_07)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_19)
       (pred_12 obj_02)
       (pred_12 obj_06)
       (pred_12 obj_11)
       (pred_12 obj_30)
       (pred_12 obj_03)

       (pred_8  obj_29 obj_27)
       (pred_8  obj_09 obj_22)
       (pred_8  obj_10 obj_13)
       (pred_9 obj_29 obj_04)
       (pred_9 obj_09 obj_18)
       (pred_9 obj_10 obj_02)
       (pred_1 obj_31)
    )

    (:goal (and
       (pred_9 obj_09 obj_11)
    ))
(:constraints
  (always (not (pred_1 obj_21)))
)
)

; plan
1. (op_5 obj_31 obj_23)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_23)
   goals met: 0 of 1
2. (op_5 obj_23 obj_20)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_20)
   goals met: 0 of 1
3. (op_5 obj_20 obj_18)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_18)
   goals met: 0 of 1
4. (op_1 obj_18 obj_09)
   deleted: (pred_9 obj_09 obj_18) (pred_5)
   added: (pred_7 obj_09)
   goals met: 0 of 1
5. (op_5 obj_18 obj_20)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_20)
   goals met: 0 of 1
6. (op_5 obj_20 obj_23)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_23)
   goals met: 0 of 1
7. (op_5 obj_23 obj_31)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_31)
   goals met: 0 of 1
8. (op_5 obj_31 obj_24)
   deleted: (pred_1 obj_31)
   added: (pred_1 obj_24)
   goals met: 0 of 1
9. (op_5 obj_24 obj_14)
   deleted: (pred_1 obj_24)
   added: (pred_1 obj_14)
   goals met: 0 of 1
10. (op_5 obj_14 obj_11)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_11)
   goals met: 0 of 1
11. (op_3 obj_11 obj_09)
   deleted: (pred_7 obj_09)
   added: (pred_5) (pred_9 obj_09 obj_11)
   goals met: 1 of 1
